<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>IBM 5120</title>
<meta http-equiv="Content-Type" content="text/html;charset=ISO-8859-1">
<meta http-equiv="X-UA-Compatible" content="IE=Edge">
<link rel="stylesheet" type="text/css" href="style.css" media="screen" title="defaut" >
<link rel="stylesheet" type="text/css" href="prtstyle.css" media="print" title="Impression" >
<link rel="alternate stylesheet" type="text/css" href="altstyle.css" media="screen" title="Blanc" >
</head>
<body>
<a name="haut"></a>
<img id="logo" alt="Chez Neriki" src="ordi.jpg">
<div id="bandeau">IBM 5120</div>
<div id="menu">
  <a class="itemm" href="index.html">Chez Neriki</a>
  <a class="itemm" href="liens.html">Liens</a>
  <a class="itemm" href="projets.php">Projets</a>
  <a class="itemms" href="5120.html">IBM 5120</a>
  <a class="itemm" href="sparcstation.html">SparcStation</a>
  <!-- a class="itemm" href="falcon.html">Falcon 030</a>
  <a class="itemm" href="next.html">NeXT Cube</a -->
  <a class="itemm" href="yopy.html">Yopy (YP3700)</a>
  <!-- a class="itemm" href="histounix.html">Unix (historique)</a -->
</div>
<div id="textecourt">
<p>
<ul id="listeliens">
 <li><a href="#pres">Pr&eacute;sentation</a></li>
 <li><a href="#histo">Historique</a></li>
 <li><a href="#doc">Documentation</a></li>
 <li><a href="#liens">Liens</a></li>
</ul>
<h1><a class="ancre" name="pres">&nbsp;</a>Pr&eacute;sentation</h1>
<p>
L'ordinateur IBM 5120, apparu avant l'IBM PC, est un "petit" syst&egrave;me qui peut tenir sur une table. Il int&egrave;gre dans un seul et imposant boitier le clavier, l'&eacute;cran et deux lecteurs de disquettes, pouvant chacun stocker 1,2 Mo de donn&eacute;es sur une disquette 8 pouces. Il appartenait &agrave; la famille 5110, comme en atteste la plaque du constructeur &agrave; l'arri&egrave;re de la machine .
</p>
<span class="illustg"><a href="5120big.jpg"><img width="275px" height="231px"  alt="IBM 5120" src="5120petit.jpg"></a>
<br>L'IBM 5120.</span>
<p>
Il se destinait principalement &agrave; la gestion et la comptabilit&eacute; et a &eacute;t&eacute; mis au point pour pouvoir &ecirc;tre installer et utiliser par des non informaticiens. On pouvait le commander avec soit le langage Basic, soit L'APL, soit les deux en rom. IBM pouvait fournir avec un ensemble d'applications de gestion et de compta.
</p>
<p>L'IBM 5120 se pr&eacute;sente donc sous la forme d'un imposant boitier de 58 cm de large sur 40 cm de haut. Il est profond de 53 cm. Son poid de 48 Kg se trouve concentré sur le coté droit de la machine, ou se trouve les lecteurs de disquettes, ce qui le rend particuli&egrave;rement difficile &agrave; d&eacute;placer.</p>
<p>Il ne poss&egrave;de pas de microprocesseur, mais un <a href="http://en.wikipedia.org/wiki/IBM_PALM_processor">processeur central (le <acronym title="Put All Logic in Microcode">PALM</acronym>)</a> composé d'un ensemble de circuits int&eacute;gr&eacute;s assembl&eacute;s sur un cirduit imprim&eacute;. Pour l'anecdote, le <acronym title="Put All Logic in Microcode">PALM</acronym> &eacute;tait d&eacute;sign&eacute; par IBM comme &eacute;tant un microprocesseur, non pas parce qu'il int&eacute;grait toute la logique sur une seule puce de silicium, mais parce qu'un partie de ses instructions &eacute;tait impl&eacute;ment&eacute;e en microcode contenue en ROM. Pour continuer dans les d&eacute;signations &eacute;tranges, les ROM (Read Only Memory) sont appel&eacute;es ROS (Read Only Storage) dans la documentation IBM de l'&eacute;poque.</p>
<span class="illustr"><a href="5120-serial.jpg"><img width="275px" height="169px" alt="Plaque de 5110-3" src="5120-serial-petit.jpg"></a>
<br>Plaque du constructeur</span>
<p>Le 5120 pouvait poss&eacute;der 16, 32, 48 ou 64Ko de RAM. Quand il est &eacute;quip&eacute; du Basic et de l'APL en m&ecirc;me temps en ROM, le passage d'un langage &agrave; l'autre s'effectue en basculant un commutateur sur le panneau avant. L'&eacute;cran de 9 pouces peut afficher 16 lignes de 64 caract&egrave;res. La logique se trouve sur un ensemble de carte enferm&eacute;e dans une cage. Celle ci contient les cartes RAM (<a  href="ci2recto.jpg">recto</a> <a href="ci2verso.jpg">verso</a>), le processeur et les cartes annexes (langages, affichages, communication) (<a href="ci1recto.jpg">recto</a> <a href="ci1verso.jpg">verso</a>).</p>
<p>Je ne poss&egrave;de que l'unit&eacute; centrale avec le Basic en rom (pas d'APL). Je poss&egrave;de &eacute;galement de la documentation et deux disquettes 8 pouces.
</p>
<p class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></p>
<h1><a class="ancre" name="histo">&nbsp;</a>Historique</h1>
<p>En 1975, IBM sort le premier ordinateur transportable (comprendre que l'on peut transporter par un homme en une fois et sans l'aide d'un camion): l'<a href="http://www-03.ibm.com/ibm/history/exhibits/pc/pc_2.html" >IBM 5100</a>. Le 5100 se compose du fameux processeur <acronym title="Put All Logic in Microcode">PALM</acronym>. Il comporte un lecteur de cartouches int&eacute;gr&eacute; contenant 204 Ko par cartouche, un &eacute;cran de 5 pouces capable d'afficher 16 lignes de 64 caract&egrave;res, de 16 &agrave; 64 Ko de ram et propose les langages Basic et APL. On peut remarquer que par rapport &agrave; lui, le 5120 ne propose pas grande chose de plus. </p>
<p>Le 5100 &eacute;tait vendu aux scientifiques et aux ing&eacute;nieurs. IBM proposait avec des bilioth&egrave;que de programmation pour les math&eacute;matiques et les statistiques.</p>
<p>En 1978 arrive l'<a href="http://www-03.ibm.com/ibm/history/exhibits/pc/pc_4.html" >IBM 5110</a>, en deux mod&egrave;les:</p>
<ul>
<li>Le 5110 Model 1: Tr&eacute;s proche du 5100, il propose en plus la possibilit&eacute;e d'&ecirc;tre reli&eacute; &agrave; un lecteur de disquette 8 pouces IBM 5114 pouvant contenir 1,2 Mo de donn&eacute;es par disquette.</li>
<li>Le 5110 Model 2: La m&ecirc;me chose que le Model 1, mais sans le lecteur de cartouches.</li>
</ul>
<p>Par rapport &agrave; l'IBM 5100, orient&eacute; calculs scientifiques et statistiques, l'IBM 5110 &eacute;tait destin&eacute; aux gestionnaires. IBM fournissait avec une importante logith&egrave;que pour la comptabilit&eacute; et la gestion d'entreprise en g&eacute;n&eacute;rale.</p>
<p>En 1980 d&eacute;barque le 5110 model 3, qui &eacute;tait vendu complet avec une imprimante sous la d&eacute;nomination IBM 5120. Celui ci reprend toute la logique interne du 5110, et int&egrave;gre un &eacute;cran plus grand et deux lecteurs de disquettes 8 pouces.</p>
<p>En 1981, sortent le System 23/Datamaster, qui reprend les forme du 5120 mais utilise un 8085 &agrave; la place du <acronym title="Put All Logic in Microcode">PALM</acronym>, et surtout le 5150, le fameux IBM PC. En mars de l'ann&eacute;e 1982, les gammes 5100 et 5110 sont abandonn&eacute;es.</p>
<p class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></p>
<h1><a class="ancre" name="doc">&nbsp;</a>Documentation</h1>
<p>
Dans la documentation se trouvait des manuels pour des applications m&eacute;tiers et la documentation livr&eacute;e avec l'ordinateur. J'ai commenc&eacute; &agrave; scanner cette derni&egrave;re (notez que certains documents concernent aussi bien le 5120 que le 5110):
</p>
<ul>
<li>Le guide de l'utilisateur Basic (Pour le 5110) 
: <a  href="5120-bas.jpg">La couverture</a></li>
<li>Manuel de r&eacute;f&eacute;rence des fonctions utilitaires (Pour le 5110)
: <a  href="5120-uti.jpg">La couverture</a></li>
<li>Proc&eacute;dure d'installation (Pour le 5120)
: <a  href="5120-ins.jpg">La couverture</a></li>
<li>Informations g&eacute;n&eacute;rales et pr&eacute;paration &agrave; l'installation (Pour le 5120)
: <a  href="5120-pre.jpg">La couverture</a> <a href="infogenerale.tar.gz">Le manuel (png tar gzip&eacute;)</a></li>
</ul>
<p class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></p>

<h1><a class="ancre" name="liens">&nbsp;</a>Liens</h1>
<ul>
<li><a href="http://mo5.com/musee/fiche.php?id=ibm5120">La fiche de l'IBM 5120 sur mo5.com.</a></li>
<li><a href="http://www-03.ibm.com/ibm/history/exhibits/pc/pc_6.html">La fiche de l'IBM 5120 chez IBM</a></li>
<li><a href="http://computermuseum.informatik.uni-stuttgart.de/dev/ibm_5110/technik/en/">Un site complet sur l'IBM 5110</a></li>
<li><a href="http://mo5.com/obsolete/index.php?p=machine&amp;id=62">La fiche de l'IBM 5120 sur Obsolete Tears</a></li>
<li><a href="http://www.brouhaha.com/~eric/retrocomputing/ibm/5100/">Une description compl&egrave;te de l'IBM 5100</a></li>
<li><a href="http://oldcomputers.net/ibm5100.html">L'IBM 5100 chez oldcomputers.net</a></li>
<li><a href="http://oldcomputers.net/ibm5120.html">L'IBM 5120 chez oldcomputers.net</a></li>
<li><a href="http://www-03.ibm.com/ibm/history/exhibits/pc/pc_2.html">La fiche de l'IBM 5100 chez IBM</a></li>
<li><a href="http://en.wikipedia.org/wiki/IBM_5100">L'IBM 5100 sur Wikipedia</a></li>
<li><a href="http://en.wikipedia.org/wiki/IBM_5110">L'IBM 5110 sur Wikipedia</a></li>
<li class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></li>
</ul>

</div>
</body>
</html>
