<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Le Yopy</title>
<meta http-equiv="Content-Type" content="text/html;charset=ISO-8859-1">
<meta http-equiv="X-UA-Compatible" content="IE=Edge">
<link rel="stylesheet" type="text/css" href="style.css" media="screen" title="defaut" >
<link rel="stylesheet" type="text/css" href="prtstyle.css" media="print" title="Impression" >
<link rel="alternate stylesheet" type="text/css" href="altstyle.css" media="screen" title="Blanc" >
</head>
<body>
<a id=haut name=haut></a>
<img id="logo" alt="Chez Neriki" src="ordi.jpg">
<div id="bandeau">Yopy</div>
<div id="menu">
  <a class="itemm" href="index.html">Chez Neriki</a>
  <a class="itemm" href="liens.html">Liens</a>
  <a class="itemm" href="projets.php">Projets</a>
  <a class="itemm" href="5120.html">IBM 5120</a>
  <a class="itemm" href="sparcstation.html">SparcStation</a>
  <!-- a class="itemm" href="falcon.html">Falcon 030</a>
  <a class="itemm" href="next.html">NeXT Cube</a -->
  <a class="itemms" href="yopy.html">Yopy (YP3700)</a>
  <!-- a class="itemm" href="histounix.html">Unix (historique)</a -->
</div>
<div id="textecourt">
<ul id="listeliens">
 <li><a href="#pres">Pr&eacute;sentation</a></li>
 <li><a href="#histo">Historique</a></li>
 <li><a href="#macos">Utilisation sous MacOSX</a></li>
 <li><a href="#liens">Liens</a></li>
</ul>
<h1><a class="ancre" name="pres">&nbsp;</a>Pr&eacute;sentation</h1>
<p>Le Yopy YP3700 est un PDA sous Linux &agrave; base d'Intel StrongARM, produit par G.Mate. Parmis ses caract&eacute;ristiques remarquables, on peut noter l'utilisation de XWindow pour la partie graphique, contrairement &agrave; d'autre appareils de poches sous Linux qui utilise une interface sp&eacute;cifique (QTopia par exemple), ce qui en fait le plus petit terminal X du monde. </p>
<span class="illustr"><a  href="yopybig.jpg"><img width="275px" height="289px"  alt="IBM 5120" src="yopy.jpg"></a>
<br>Le Yopy YP3700.</span>
<p>Le Yopy est aussi tr&egrave;s proche de l'autre PDA sous Linux, le Zaurus: m&ecirc;me famille de processeur, m&ecirc;me noyau pour l'OS, connection USB identique (le driver USB pour MacOSX et Linux est le m&ecirc;me pour les deux machines). </p>
<p>Ses autres caract&eacute;ristiques sont:</p>
<ul>
<li>Processeur Intel SA-1110 &agrave; 206Mhz</li>
<li>M&eacute;moire: 32 Mo flash int&eacute;gr&eacute;e, 128 Mo SDRAM</li>
<li>Extension CompactFlash, SD et MMC</li>
<li>Ecran: 240x320, 65 536 couleurs, r&eacute;tro&eacute;clair&eacute;</li>
<li>Port s&eacute;rie, USB, casque.</li>
<li>Micro et haut parleur int&eacute;gr&eacute;s</li>
</ul>
<p>Le Yopy poss&egrave;de de nombreux logiciels livr&eacute;s avec, dont un navigateur web (Dillo), un lecteur de Mail, un lecteur MP3, des jeux (dont xrick, un clone de Rick Dangerous et Doom) et la suite bureautique Hancom Mobile Office. L'utilisation de XWindow et de Linux facilite &eacute;galement le portage des applications Unix et Linux (VLC, Xmame...). Enfin, il utilise un syst&egrave;me de gestion de paquetage RPM, l'installation de logiciel en est facilit&eacute;e. </p>
<p>Personnellement, je n'ai pas pris le Yopy pour son c&ocirc;t&eacute; PDA, mais plus pour son  c&ocirc;t&eacute; jouet de geek. La présence de Linux, XWindow, la gestion du r&eacute;seau par l'USB ou le Wifi et la disponibilit&eacute; de Python, Perl, GCC, MySQL  et d'autre outils de d&eacute;veloppement en font un vrai serveur/station de travail Unix tenant dans la poche.</p>
<p>Certains sites Web ont pour habitude de montrer un dmesg de leur machine, alors voici <a href="yopydmesg.txt" >celui du Yopy</a>.</p>
<p class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></p>

<h1><a class="ancre" name="histo">&nbsp;</a>Historique</h1>
<p>
Le Yopy est pr&eacute;sent&eacute; pour le premi&egrave;re fois au <a href="http://www.gicom.de/yopy/" >CeBit 2000 par Samsung</a>. C'est un PDA sous Linux mis au point par GMate, une petite startup cor&eacute;enne.
Samsung se retirant de l'aventure avant la production, GMate d&eacute;cide quand m&ecirc;me de commercialiser le Yopy YDK-1000 (YOPY Development Kit), &agrave; destination des d&eacute;veloppeurs.</p>
<p>Le YDK-1000 sera suivi ensuite par les mod&egrave;les &agrave; destination du grand public:</p>
<ul>
	<li>Le YP3000, 64 Mo de ram, 16 Mo de flash, lecteur MMC et pas de r&eacute;tro&eacute;clairage.</li>
	<li>Le YP3500, 128 Mo de ram, 32 Mo de flash, lecteur MMC et &eacute;cran r&eacute;tro&eacute;clair&eacute;.</li>
	<li>Le YP3700, d&eacute;crit ci dessus.</li>
</ul>
<p>Le Yopy sera import&eacute; en France par <a href="http://tuxmedia.com/" >Tuxmedia</a>.</p>
<p>En mars 2005, la soci&eacute;t&eacute; GMate ferme ses portes, c'est <a href="http://linuxfr.org/~Sol_Bianca/17713.html" >la (triste) fin</a> du Yopy.</p>
<p class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></p>

<h1><a class="ancre" name="macos">&nbsp;</a>Utilisation sous MacOSX</h1>
<p>Le Yopy communique avec le monde ext&eacute;rieur gr&acirc;ce &agrave; une liaison r&eacute;seau IP. La liaison s'effectue gr&acirc;ce au port USB ou au travers d'une carte wifi Compact Flash.</p>
<p>Le driver r&eacute;seau USB pour MacOSX est disponible <a href="http://www.lucid-cake.net/osx_zaurus_usb/index_en.html" >ici</a>.</p>
<p>Une fois la liaison effectu&eacute;e, il suffit de se connecter au Yopy en utilisant son adresse IP. Il propose plusieurs services comme le FTP, pour transf&eacute;rer des donn&eacute;es, telnet pour ouvrir un shell et un <a  href="yopy-web.png">serveur web</a> qui reprend les fonctions <acronym title="Personal Information Manager"> PIM</acronym> du Yopy et propose l'upload vers le Yopy ainsi que la sauvegarde des information du <acronym title="Personal Information Manager"> PIM</acronym>.</p>
<p class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></p>
<h1><a class="ancre" name="liens">&nbsp;</a>Liens</h1>
<ul>
<li><a href="http://www.gicom.de/yopy/">Le Yopy pr&eacute;sent&eacute; par Samsung au CeBit</a></li>
<li><a href="http://www.yopy.lug.org.uk/">Le Yopy User Group d'Angleterre</a></li>
<li><a href="http://www.kyug.net/english/">Le Yopy User Group de Cor&eacute;e</a></li>
<li><a href="http://www.linuxfrench.net/article.php3?id_article=1046">Une interview de l'ancien importateur du Yopy</a></li>
<li><a href="http://www.linuxdevices.com/articles/AT9898112976.html">Le test du Yopy par Linux Device</a></li>
<li><a href="http://www.zaurusfr.org/">ZaurusFr propose une section pour le Yopy</a></li>
<li><a href="http://cedric.surlemont.free.fr/">Blog sur la bidouille hard et soft du Yopy</a></li>
<li><a href="http://www.tuxmedia.com/yopydev/default.jsp">La Yopyth&egrave;que de Tuxmedia</a></li>
<li><a href="http://yopydownload.free.fr/phpmalogitheque/">Une autre Yopyth&egrave;que</a></li>
<li><a href="http://yopy.palmopensource.com/">La section Yopy de palmopensource.com</a></li>
<li class="retour"><a href="#haut">Revenir en d&eacute;but de page</a></li>
</ul>

</div>
</body>
</html>
